Revit 2027 API
Element.Name Property
A human readable name for the Element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual string Name { get; set; }
Public Overridable Property Name As String
	Get
	Set
public:
virtual property String^ Name {
	String^ get ();
	void set (String^ value);
}
abstract Name : string with get, set
override Name : string with get, set
Property Value
String
Exceptions
Exception | Condition
InvalidOperationException | Thrown when the name of the element cannot be changed.
ArgumentException | Thrown when the element requires a unique name and a non-unique name is set.
Remarks
The Name property is a human readable name for the element, such as Wall.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace